contrib/axismora/samples/rq/distanceS.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<m:distance xmlns:m="Some-URI">
			<Point>
				<x>8</x>
				<y>8</y>
			</Point>
			<Point>
				<x>5</x>
				<y>4</y>
			</Point>
		</m:distance>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
